{
   "Recipes": [
      {
         "Title": "Brown Butter Miso Coffee Chocolate Chip Cookies",
         "Id": 3,
         "Type": "Sweets",
         "OriginalURL": "https://www.purelykaylie.com/vegan-chocolate-chip-cookies/#tasty-recipes-7002-jump-target",
         "Ingredients": [
            "112 g browned butter",
            "220 g light brown sugar (or 190 g of brown sugar + 30 g of coconut sugar)",
            "3 tbsp granulated sugar",
            "2 tbsp white miso paste",
            "65 ml (¼  cup) brewed coffee",
            "2 tsp vanilla extract",
            "219 grams all-purpose flour",
            "1 tsp baking soda",
            "¼ tsp salt",
            "1 cup chocolate chips"
         ],
         "Steps": [
            "Preheat the oven to 350°F. Line a large baking sheet with parchment paper.",
            "Brown the butter and set it aside. Once cooled, add in a large bowl along with brown sugar, and granulated sugar. Using a handheld mixer or stand mixer, cream the butter and sugar together just until combined (about 1-2 minutes). Add the coffee, miso paste and vanilla extract. Cream together once more to combine.",
            "Add the all-purpose flour, baking soda, and salt to the bowl. Fold the ingredients together until evenly combined. Then, stir in the chocolate chips.",
            "Cover the cookie dough with cling wrap and place in the refrigerator to chill for at least 30 minutes.",
            "Scoop the cookie dough into balls and transfer to the baking sheet.",
            "Bake cookies for 12 minutes on the middle rack in your oven. The center should  appear underbaked. Once you remove them from the oven, let the cookies rest for 5 minutes on the baking sheet. They will de-puff and firm up while cooling. "
         ]
      },
      {
         "Title": "Fennel Shakshuka",
         "Id": 0,
         "Type": "Breakfast",
         "OriginalURL": "http://shemeshkitchen.com/not-shakshuka/",
         "Ingredients": [
            "4 eggs",
            "10-12 cherry tomatoes, quartered",
            "½ fennel, finely sliced",
            "1 stalk lemongrass, bashed and finely chopped",
            "5-7 anchovy fillets",
            "1 sprig rosemary, leaves finely chopped",
            "1 hot green chili (optional)",
            "Vermouth or Pernod",
            "capers, roughly chopped",
            "handful dill, chopped",
            "olive oil",
            "flaky salt"
         ],
         "Steps": [
            "In a large pan, heat olive oil, add the anchovy and break down slightly with a wooden spoon.",
            "Add the rosemary, lemongrass and chili and saute for 1-2 minutes to infuse the flavours in the oil. Add the fennel and continue sauteing for about 3 minutes. Add the pernod and tilt towards the flame (or use a lighter if cooking on induction), continue cooking for 2 minutes after the fire has died down to soften the fennel. Add the tomatoes and capers, cooking for about 3 minutes longer to allow them to break down a little.",
            "Lower the heat and break in the eggs, seasoning them with salt (the rest should be salty enough thanks to the anchovy).",
            "Cook for about 5 minutes, use the spoon to assure no parts of white remain uncooked. You want cooked white and runny yolk (unless you want something else, but in that case you're on your own). Finish with chopped dill and a drizzle of olive oil."
         ]
      },
      {
         "Title": "Matcha-Lemon-Cranberry Muffins",
         "Id": 3,
         "Type": "Sweets",
         "OriginalURL": "https://www.beautifuleatsandthings.com/2018/03/16/light-and-fluffy-matcha-lemon-muffins/",
         "Ingredients": [
            "1 ¾ cups flour",
            "1 tbsp baking powder",
            "1 ¼ tbsp matcha powder",
            "½ tsp salt",
            "½ cup + 1 tbsp cup sugar",
            "¾ cup unsweeteneplant-based milk",
            "2 tsp vanilla extract",
            "¼ cup coconut oil",
            "1 flax egg",
            "Juice + zest of 1 lemon",
            "1 cup fresh cranberries"
         ],
         "Steps": [
            "Pre-heat oven to 400°F degrees.",
            "In a large bowl, combine flour, baking powder, matcha, salt, and sugar. Set aside.",
            "In a medium bowl, mix together milk, vanilla, egg, oil, lemon juice, and lemon zest.",
            "Add wet ingredients to the dry ingredients and stir until combined but be careful not to over-stir. Over-stirring will result in tough, dense muffins.",
            "Add muffins liners to muffin tins or spray tins with non-stick cooking spray.",
            "Distribute the batter evenly into the muffin tins and bake for approximately 15-17 minutes or until fork comes out clean. Transfer to wire rack and let cool."
         ]
      },
      {
         "Title": "Vegan Banana Chocolate Chip Muffin",
         "Id": 3,
         "Type": "Sweets",
         "OriginalURL": "https://cloudykitchen.com/blog/vegan-banana-muffins/#tasty-recipes-16894-jump-target",
         "Ingredients": [
            "240 g Plant based milk",
            "150 g granulated sugar",
            "110 g neutral oil",
            "14 g (3 tsp) apple cider vinegar",
            "14 g (3 tsp) vanilla extract or vanilla bean paste",
            "290 g all purpose flour",
            "1 tsp baking powder",
            "1 tsp baking soda",
            "6 g (1 tsp) salt",
            "280 g very ripe banana, diced (not mashed)"
         ],
         "Steps": [
            "Preheat the oven to 350°F (180°C). Grease your muffin pan.",
            "In a small bowl, whisk together the milk, sugar, oil, apple cider vinegar and vanilla.",
            "In a medium bowl, whisk together the flour, baking powder, baking soda, and salt. Add the wet ingredients and mix until just combined. Add the chopped banana and mix to incorporate, then fold in the chopped chocolate.",
            "Divide the batter evenly between the 6 muffin cups. Sprinkle the tops with extra chocolate",
            "Bake the muffins for 20 to 22 minutes or until the tops spring back when lightly pressed.",
            "Remove from the oven and allow to cool in the pan for 5-10 minutes then remove from the pan and allow to cool completely on a wire rack."
         ]
      },
      {
         "Title": "Vegan Carrot Muffins",
         "Id": 3,
         "Type": "Sweets",
         "Ingredients": [
            "170 g all-purpose flour",
            "65 g wholewheat flour",
            "2 tsp baking powder",
            "½ tsp baking soda",
            "110 g brown sugar",
            "60 g white sugar",
            "120 ml vegetable oil",
            "120 ml soy milk",
            "2 tsp apple cider vinegar",
            "230 grams carrots, peeled & grated",
            "1 tsp vanilla extract",
            "zest of 1 orange",
            "2 tsp cinnamon",
            "½ tsp ginger powder",
            "pinch of nutmeg",
            "pinch of salt",
            "60 g pecan nuts, chopped",
            "¼ cup raisins"
         ],
         "Steps": [
            "Preheat the oven to 360°F (180°C). Lightly grease a smaller rectangle baking pan and line with a strip of parchment paper.",
            "In a large bowl, mix brown sugar, white sugar, vegetable oil, soy milk, apple cider vinegar, vanilla, and orange zest.",
            "In a separate bowl mix flours, baking powder, baking soda, cinnamon, ginger, nutmeg, and salt. Sift the dry ingredients onto the wet ingredients and gently mix with a spatula until just combined, and there are no lumps of flour visible but don't overmix the batter.",
            "Fold the grated carrots and chopped pecans into the batter. Distribute the batter evenly into the muffin tins and Bake for about 40-50 minutes.",
            "Remove the baked cake from the oven and let rest in the baking pan for about 15-20 minutes, then transfer the cake onto a kitchen rack and let cool down completely."
         ]
      },
      {
         "Title": "Vegan Green Sauce Pasta",
         "Id": 1,
         "Type": "Main",
         "OriginalURL": "https://www.instagram.com/p/CYoywRal9CL/",
         "Ingredients": [
            "1lbs pasta of choice",
            "3 tbsp olive oil, separated",
            "2 tbsp vegan or regular butter, separated",
            "1 tsp thyme",
            "1 shallot, finely minced",
            "2 garlic cloves, finely minced",
            "1 cup mushrooms, finely minced",
            "2 stalks greens onions, finely minced",
            "½ cup kale, roughly chopped",
            "2 cups spinach",
            "¼ cup pine nuts",
            "Zest and juice of one lemon",
            "½ cup pasta water",
            "1 tsp kosher salt"
         ],
         "Steps": [
            "Bring a large pot of salted water to a rolling boil, and cook pasta according to package instructions. ",
            "In a large skillet, add 1 tbsp olive oil, 1 tbsp butter, thyme, shallot, garlic, mushrooms, green onions, and kale. Cook on low for 6-7 minutes, until soft.",
            "Add spinach, pine nuts, zest and juice of one lemon, and salt to a blender or food processor. Blend until incorporated.",
            "Add the cooked mixture to the blender and blend until smooth-ish. Drizzle in remaining olive oil, remaining butter, and 1/2 cup of pasta water. Blend until smooth and silky. ",
            "Once your pasta is cooked, saturate your pasta in sauce, and top with loads of black pepper, grated cashew, parmesan and/or chili oil."
         ]
      },
      {
         "Title": "Preserved Ingredient Cannellini Bean Salad",
         "Id": 2,
         "Type": "Side",
         "OriginalURL": "https://www.instagram.com/p/Cm9cWVUocxP/",
         "Ingredients": [
            "1 15 oz can of cannellini beans",
            "4-5 jarred roasted piquillo peppers, sliced",
            "6-7 jarred quartered and marinated artichoke hearts plus some of the oil",
            "4-5 guindilla peppers, chopped",
            "1 bunch of dill with stems, finely chopped",
            "½ preserved lemon, finely chopped (about 1 tbsp)",
            "1 tbsp mustard",
            "Squeeze of lemon",
            "1 tbsp olive oil",
            "3 tbsp olive oil",
            "2 tbsp capers in salt",
            "1 cup panko breadcrumbs",
            "1 cup pistachio slivers or desiccated coconut, grounded"
         ]
      },
      {
         "Title": "Ranginak (Persian Date Walnut Dessert)",
         "Id": 3,
         "Type": "Sweets",
         "OriginalURL": "https://www.instagram.com/p/CrJxQTHKed4/",
         "Ingredients": [
            "3 tbsp coconut sugar",
            "1 tsp cinnamon",
            "½ tsp cardamom",
            "pinch of salt",
            "25-30 pitted dates",
            "1 cup walnuts",
            "¾ cup (185g) unsalted butter, melted",
            "1 ½ cup oat flour"
         ],
         "Steps": [
            "Mix the sugar, cinnamon and cardamom in a small bowl and set aside.  ",
            "In a frying pan, toast the walnuts on medium-high heat, stirring every so often until fragrant (5-8 minutes) and set aside.  ",
            "In the same pan, switch heat to low and melt the butter. While the butter melts, stuff the dates with the walnuts and arrange at the base of a an 8 inch pie dish or cake pan and pack them in as much as you can.   ",
            "Go back to the butter, turn the heat to medium-high and combine the flour with a rubber spatula. keep stirring, making sure to scrape the base so it doesn’t burn until it thickens up slightly. Take off the heat when it smells toasty and fragrant.",
            "Pour the mixture on top of the dates. Let cool for about 5 mins before sprinkling the sugar-cinnamon mixture and carefully spreading with your hands. Sprinkle the ground pistachio on top and press down gently but firmly.  ",
            "Allow it to cool and set in the fridge for at least an 4 hours before slicing."
         ]
      },
      {
         "Title": "Fennel Syrup French 75",
         "Id": 6,
         "Type": "Beverage",
         "OriginalURL": "https://www.instagram.com/p/Cac0dARvipU/",
         "Ingredients": [
            "1-2 cups of finely chopped fennel stalks",
            "1 cup sugar",
            "1 cup water",
            "1 oz gin",
            "*½ oz fennel simple syrup",
            "½ small lemon juiced (½ oz)",
            "Champagne or other sparkling wine"
         ]
      }
   ]
}